<?php
ini_set('error_reporting', E_ALL);
ini_set('display_errors', 1);
ini_set('display_startup_errors', 1);

require 'functions.php';


// Задание #1
echo "<b>ЗАДАНИЕ 1</b><br><br>\n";
$s = task1(['Ночь', 'Улица', 'Фонарь', 'Аптека'], true);
echo $s . "<br>\n";
echo "<br>--------------------------------------------------------<br>\n";


// Задание #2
echo "<b>ЗАДАНИЕ 2</b><br><br>\n";
task2([1, 2, 3], '+');
echo "<br>--------------------------------------------------------<br>\n";


// Задание #3
echo "<b>ЗАДАНИЕ 3</b><br><br>\n";
task3('*', 6, 5, 4, 3, 2, 1);
echo "<br>--------------------------------------------------------<br>\n";


// Задание #4
echo "<b>ЗАДАНИЕ 4</b><br><br>\n";
task4(8, 8);
echo "<br>--------------------------------------------------------<br>\n";


// Задание #5
echo "<b>ЗАДАНИЕ 5</b><br><br>\n";
task5('helloworld');
task5('wovvow');
task5("Лидер Венере не вредил");
task5("Солнечный день в ослепительных снах");
echo "<br>--------------------------------------------------------<br>\n";


// Задание #6
echo "<b>ЗАДАНИЕ 6</b><br><br>\n";
task6();
echo "<br>--------------------------------------------------------<br>\n";


// Задание #7
echo "<b>ЗАДАНИЕ 7</b><br><br>\n";
task7();
echo "<br>--------------------------------------------------------<br>\n";


// Задание #8
echo "<b>ЗАДАНИЕ 8</b><br><br>\n";
task8('test.txt');
echo "<br>--------------------------------------------------------<br>\n";


// Задание #9
echo "<b>ЗАДАНИЕ 9</b><br><br>\n";
task9('anothertest.txt');
echo "<br>--------------------------------------------------------<br>\n";
